CREATE DATABASE  IF NOT EXISTS `autocatalogue` /*!40100 DEFAULT CHARACTER SET utf8 */;
USE `autocatalogue`;
-- MySQL dump 10.13  Distrib 5.5.9, for Win32 (x86)
--
-- Host: localhost    Database: autocatalogue
-- ------------------------------------------------------
-- Server version	5.1.63-0ubuntu0.11.10.1

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `Name2Code`
--

DROP TABLE IF EXISTS `Name2Code`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `Name2Code` (
  `Name2CodeId` int(11) NOT NULL AUTO_INCREMENT,
  `Name` varchar(45) DEFAULT NULL,
  `Code` varchar(45) DEFAULT NULL,
  `UpdateTime` mediumtext,
  PRIMARY KEY (`Name2CodeId`),
  UNIQUE KEY `Name2CodeName_UNIQUE` (`Name`)
) ENGINE=InnoDB AUTO_INCREMENT=148 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `Name2Code`
--

LOCK TABLES `Name2Code` WRITE;
/*!40000 ALTER TABLE `Name2Code` DISABLE KEYS */;
INSERT INTO `Name2Code` VALUES (1,'Description:','215$a','1327492651'),(3,'Main title:','200','1327492651'),(4,'Meeting name:','712$a','1327492651'),(5,'Notes:','300$a','1327492651'),(8,'Personal name:','200$f','1327492651'),(9,'Published/Created:','210$a','1327492651'),(11,'Related names:','701$a','1327492651'),(12,'Dewey class no.:','676$a','1327492651'),(13,'Related titles:','517$a','1327492651'),(14,'Subjects:','610$a','1327492651'),(15,'Type of material:','105$a','1327492651'),(16,'一般性附注','300$a','1327492651'),(17,'一般资料标识','200$b','1327492651'),(18,'一般附注项','300$a','1327492651'),(19,'与版本有关的责任说者','205$f','1327492651'),(20,'专著','105$a','1327492651'),(21,'丛编','225$a','1327492651'),(22,'丛编的','225$x','1327492651'),(23,'Edition:','205$a','1327492651'),(24,'丛编题名','225$a','1327492651'),(25,'个人名称等同','701$a','1327492651'),(26,'中图分类号','690$a','1327492651'),(27,'会议名称','601$a','1327492651'),(28,'作品语种','101$a','1327492651'),(29,'使用本字段的机构','200$5','1327492651'),(30,'其他细节项','215$c','1327492651'),(31,'其他责任说明','200$g','1327492651'),(32,'其他题名','517$a','1327492651'),(33,'其他题名信息','225$e','1327492651'),(35,'出版发行地','210$a','1327492651'),(36,'出版发行日期','210$d','1327492651'),(37,'出版发行等','210$a','1327492651'),(38,'出版发行者','210#c','1327492651'),(39,'出版发行项','210$a','1327492651'),(40,'出版或制作国别','102$a','1327492651'),(41,'分丛编号','225$h','1327492651'),(42,'分丛编名称','225$i','1327492651'),(43,'分辑号','200$h','1327492651'),(44,'分辑名','200$i','1327492651'),(46,'制作日期','210$h','1327492651'),(47,'卷期标识','711$a','1327492651'),(48,'卷标识','200#v','1327492651'),(49,'另一著者的正题名','200$c','1327492651'),(50,'团体名称等同','711$a','1327492651'),(51,'国别','102$a','1327492651'),(52,'国际标准书号','010$a','1327492651'),(53,'国际标准书号获得方式和定价','010$d','1327492651'),(54,'国际标准连续出版物号','011$a','1327492651'),(56,'ISBN/价格','010$d','1327492651'),(57,'学科主题','606$a','1327492651'),(58,'尺寸','905$c ','1327492651'),(59,'并列丛编题名','105$a','1327492651'),(60,'并列正题名','200$d','1327492651'),(61,'并列版本说明','205$d','1327492651'),(62,'并列题','225issn$z','1327492651'),(63,'并列题名','200$d','1327492651'),(64,'排架分类号','905$c','1327492651'),(65,'提要','105$a','1327492651'),(66,'文字资料—形态特征','106$a','1327492651'),(67,'ISBN:','010$a','1327492651'),(68,'文字资料专著','105$a','1327492651'),(69,'文献数量','215$a','1327492651'),(70,'文献类型','205$a','1327492651'),(71,'正题名','200','1327492651'),(72,'正题名的汉语拼音','200$9','1327492651'),(74,'版本说明','205$a','1327492651'),(75,'版本项','205$a','1327492651'),(76,'相关责任说明','200$g','1327492651'),(78,'LC classification:','680$a','1327492651'),(80,'记录控制号','001$a','1327492651'),(82,'记录来源','801$a','1327492651'),(83,'责任说明','225$f','1327492651'),(84,'载体形态','215$a','1327492651'),(85,'载体形态项','215$a','1327492651'),(86,'通用处理数据','100$a','1327492651'),(87,'附件','215$e','1327492651'),(88,'附加版本说明','205$b','1327492651'),(90,'附注项','300$a','1327492651'),(91,'题名与责任说明','200','1327492651'),(92,'题名责任者项','200','1327492651'),(93,'版本附注','305$a','1327492651'),(98,'丛编项','225$a','1329134049'),(99,'总集','461$a','1329134049'),(100,'个人名称次要','702$a','1329134049'),(102,'载体形态附注','307$a','1329272901'),(103,'相关题名附注','304$a','1329913289'),(104,'其它题名','517$a','1330142617'),(105,'资料类型','106$a','1330154861'),(106,'控制号','001$a','1330154861'),(107,'最近处理日期','#011','1330154861'),(108,'定长字段','100$a','1330154861'),(109,'ISBN号','010$a','1330154861'),(110,'编目来源','801$a','1330154861'),(112,'杜威十进索取','676$a','1330154861'),(115,'ME-个人名称','701$a','1330154862'),(116,'题名','200','1330154862'),(117,'变异题名','517$a','1330154862'),(118,'出版项','210$a','1330154862'),(119,'书目附注','320$a','1330154862'),(120,'原版附注','306$a','1330154862'),(121,'主题-课题-LC','606$a','1330154862'),(122,'编目许可','801$a','1330154862'),(125,'非控主题词','610$a','1333172859'),(127,'LC control no.:','!006','1334366734'),(128,'LCCN permalink:','!005','1334366734'),(129,'Quality code:','!004','1334366734'),(130,'Links:','!003','1334366734'),(131,'Electronic file info:','!002','1334366786'),(132,'Other system no.:','!001','1334366812'),(133,'FMT','#004','1334367211'),(134,'头标区','#003','1334367211'),(135,'记录最后处理','#002','1334367211'),(136,'OWN','#001','1334367211'),(137,'系统号','#005','1334367382'),(139,'LC索取号','#006','1334367537'),(141,'索取号','#007','1334367537'),(143,'本地 LC 类型索','#008','1334370104'),(144,'096','#009','1334370104'),(145,'004','#010','1334370104'),(146,'049','#012','1334370402'),(147,'第一责任说明','200$f','1334495445');
/*!40000 ALTER TABLE `Name2Code` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2012-06-27 22:20:09
